{
  "posts": [
    {
      "content": "折腾了好久，重要弄好了博客。一个全新的展示平台。\r\n这里主要进行一些生活的感悟，技术的思考。\r\n首页用的景安的php免费空间，并进行了域名备案。\r\n内容页用Grida进行了搭建，并同步到了Github托管。通过这样的方式，把内容和首页进行了分离，还保证首页运行在备案的景安服务器上。\r\n\r\n这里还记录一些前端的心得体会，HTML、CSS、JavaScript，包括jQuery、Vue、React的框架，以及Node等。\r\n\r\n路漫漫其修远兮，吾将上下而求索，继续努力把！",
      "data": {
        "title": "新的开始",
        "date": "2020-05-14 14:40:49",
        "tags": [],
        "published": true,
        "hideInList": false,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "",
      "fileName": "xin-de-kai-shi"
    },
    {
      "content": "转眼又是5月12日，地震的纪念日，也是协会的成立日，也是获得感动校园人物的日子。来北京上班两天了，又要逐渐熟悉早起的日子，而现在要更早。以前6点30出发，现在得6点出发，又早了半小时。\r\n在家从1月21日呆到5月10日，100天了，3个多月了，很久没有在家呆这么久了，都块熟悉在家的日子了。\r\n转眼才发现年初定的三大计划，react、node、php、wordpress，竟然还在原地停留，真是忙起来就忘了学习。\r\n不过还是有所成长的，最近弄了个gulp脚手架，对页面制作公用也有更深理解。\r\n今年剩下的日子，希望把react、node、wordpress先研究透彻了。\r\n而理财因为在2740点下车，现在2900点了，真是后悔太早卖掉了，不过一切来得及，不要太过慌张。\r\n\r\n5月14日\r\n今天6点出发，6点05就上车了，班车6点10分就出发了，到了公司就6点半。结果半个小时进不了大门，二维码不对。上午又去物业问，也没结果。\r\n\r\n来北京1周了，感觉时间很漫长，天天早起，早回。",
      "data": {
        "title": "写在2020年5月",
        "date": "2020-05-13 08:39:52",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "",
      "fileName": "xin-wen-zhang-ce-shi"
    },
    {
      "content": "2020，没有小学作文里的机器世界，也没有中学幻想中的西装革履，可能还不小心拉低了小康社会的平均水准。很惭愧，那就尽量做个不给社会添乱的小人物吧。在代码里为中国知识基础设施工程奉献一点小小的力量，在柴米油盐中斤斤计较，在朝九晚五里孜孜不倦，在吃吃喝喝中告别过去，在磕磕绊绊里原谅自己。得不到的不在意失，已拥有的好好去惜。曾经，豪情万丈，此际，平静虚无。再见，2019，很高兴见到你，20年代！\r\n——题记\r\n\r\n人生总要仪式感，我在北京卫视看着跨年玩会，随着倒计时的结束，发着朋友圈和祝福，开启了2020年的生活。2019年，是来公司的第三年，这一年一如寻常，没有太大的突破。这一年又有许多故事，许多得失。\r\n\r\n2019年时光飞逝，这一年在前端开发领域有所收获、也有所经验。回顾这一年，主要做的项目有赛事星、手机知网、工具书、专题站、看典项目。使用的技术也从基本的样式重构、到前端开发，从jQuery的基本效果制作到Vue前端框架，熟练程度也越来越高。\r\n\r\n实际上，从2016年开始，vue、react和angular已经逐渐开始流行，学习vue的日程早就提上，也在b站上看了很多vue的教程，但是就是缺乏使用，所以至今仍然只会基本操作。教程看了一次又一次，无非就是手册上的内容。缺乏的是深入的实践。\r\n\r\n后台语言方面，早在2014年的时候，就开始人生苦短，我用python，看了很多的教程，还想研究一下flask和django框架，实际上对python的学习，浅尝辄止。看着官方手册做出一点小小的网站，就自以为是，逐渐不再使用，逐渐放弃。\r\n\r\n而对php的研究，则更早在2011年，学会搭建环境，使用织梦cms参加比赛，知道一些基本的语法，包括数据库的增删改查看着手册也能顺下来，也曾搭建过wordpress网站，做过古代精品课，只是长时间的不使用，便越发忘记了。\r\n\r\n对node的研究也看了一番教程，但是却缺乏大规模的使用。知道express和koa，却并不深入。数据在前端如何实现基本了解，可是后端还有一系列的思考，却需要更加深入的认识和理解。兜兜转转，原地踏步。研究的知识很多，不用就淡忘了。\r\n\r\n在新的2020年，前端三大框架夯实react，能够使用react开发具有高复杂度的后台项目，熟练的使用ant design。后台语言方面，对php和nodejs有深入的研究，数据库增删改查，设计模式等等。能够使用wordpress实现符合需求的站点建设。这三条工作目标，每年都提上日程，最终都不了了之，希望今年能够至少实现2个。\r\n\r\n生活方面，1月到7月，居住在北辰机械厂宿舍，一个月房租3300+中介费300。不管多冷多热，都骑小蓝车或者摩拜上下班，本来天天早晨早起找车，后来发现可以把车推到家里，方便。7点半起床，到公司时间都绰绰有余。虽然屋子大，但是大部分时间还是自己居住，也没有出去找过什么朋友，房子没有联网，而流量又很慢。只能白天离线一点视频，晚上观看。有时候晚上对着天花板发呆，还是挺无聊的。盒饭每周吃也腻，周末可以做个饭，揪片还是很好吃的。到了7月就搬到宏福苑新宿舍了，只有60元一个月的房租，这样算下来后半年省了2万房租。天天又习惯了6点多起床，坐班车的上下班生活。每天班车6:50发车，大部分时间可以7:30到公司，遇到堵车要8：30, 不过堵车的次数不是很多。\r\n\r\n娱乐方面，2019年的娱乐活动主要是视频吧。综艺方面：奔跑吧兄弟，极限挑战，天天向上，明星大侦探，奇葩说，吐槽大会。动漫方面：命运石之门、斗罗大陆。小说方面：斗罗大陆。还参加了5、6次羽毛球活动，从一点不会，到勉强能打。参加了两次跳大绳活动。认识了新朋友，怡楠亚美佳琪蕾老师马红芳钟佳言钟巧玲。还去怡楠家一起吃了个饭。去了青龙峡，看了大坝，爬了青龙峡的长城。王者荣耀和怡楠佳琪在s16赛季一起娱乐，第一次上了星耀，不过s17赛季就没怎么玩了。去了一次延安西安，参加王健哲的婚礼，去张初晗家住了一晚上，见了大狗二狗和小狗。一切都是那么熟悉和令人感动。毛玉环来北京，园区吃了个饭。薛州洋搬家，去上地见了一面。王弘斐换工作，说了说自己和母亲的遭遇，园区见了一面。\r\n\r\n情感方面，周围的同学大都生活稳定，孩子会打酱油了，而我大概就是命运石之门吧。希望2020，一切安定下来。\r\n\r\n理财方面，基金定投终于见到了成效，股票亏了一些，戒了。4月大盘大跌没躲过，算下来还不如长期持有300ETF呢。基金赚了一些，不错。总体还是赚了。2020年会更加稳重，稳妥。减少对资产波动的焦虑。\r\n坚持且慢定投、坚持稳稳地幸福\r\n2019年做了两个项目，一个是地图唐诗项目，一个是中国银行大堂项目。还算小有收益。\r\n\r\n2020年的计划：\r\n\r\n* Node.js 大师之路，认真学习后台语言\r\n* 全面贯彻react的思想，使用react制作大型项目\r\n* 学习php和wordpress，更进一步\r\n* 用招商银行认真记账，记录资金情况\r\n* 认真坚持且慢定投，坚信复利的力量\r\n* 坚持每周一篇日记，不荒度每天\r\n* 认真对待周围的人、事、物，珍惜眼前的美好。\r\n* 认真看2部动漫、2部电视剧、2部综艺\r\n* 王者荣耀上王者，完成最初的心愿\r\n  \r\n希望2021年的时候，这些计划能够全部完成。",
      "data": {
        "title": "回顾2019，展望2020",
        "date": "2020-01-02 08:58:54",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "",
      "fileName": "hui-gu-2019zhan-wang-2020"
    },
    {
      "content": "一直以来研究了很多记账方法：支付宝、随手记、钱迹……都不是很理想，直到发现了招商银行。把握入口，一切尽在自动完成。\r\n\r\n<!-- more -->\r\n使用传统的随手记，每天总要记录，难不免会忘记。后来使用网易有钱导入，又会有安全问题。支付宝虽然能记录，但是仅仅局限在支付宝，没有办法扩充到其他项目。实际上，招商银行app，可以把以上全部需求全部满足。\r\n\r\n招商银行app和掌上生活是两个app，在此使用的是招商银行app。在首页的上方，有醒目的按钮：收支明细。这里可以把所有招商银行借记卡、信用卡的钱汇总。还可以手工单独记账。\r\n\r\n于是只要把握好钱的入口即可。平常网络消费主要集中在三个地方：支付宝、微信、小米支付。全部绑定了招商信用卡和招商借记卡。优先使用信用卡，不能使用信用卡的场合使用借记卡。还信用卡的时候使用工资卡建行还钱，不影响支出记账。只有在用非招行渠道取现金的时候，在手工的在app中记账即可。记录的是大头，具体1块钱1块钱怎么花，不记录。比如用建行工资卡取现100元，只要在app中记录100元日常生活就行。这样一来，只需要少量调整具体项目的分类，和记录一些atm的取款，其他的都会自动生成。\r\n\r\n一年要花数个小时时间，把所有记录在手工规整到钱迹app中，长期保存。",
      "data": {
        "title": "如何记账",
        "date": "2019-11-30 14:32:38",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "一直以来研究了很多记账方法：支付宝、随手记、钱迹……都不是很理想，直到发现了招商银行。把握入口，一切尽在自动完成。\r",
      "fileName": "ru-he-ji-zhang"
    },
    {
      "content": "独立开发者，就是一个人做项目。想想从学校到现在，我做过哪些项目。一些启发和思考，记录在此。\r\n\r\n<!-- more -->\r\n第一个项目是西安工业大学人文学院网站，用的VSB2008系统。简单的说就是把psd导入，用一些可视化的方式，把各种列表组件放置。基本没有用到什么代码。\r\n\r\n第二个项目是巨创官网，网上找了个静态页，随便修改修改其中的内容。用了一些css，仅此而已。\r\n\r\n第三个项目是西安工业大学中国古代文学史精品课，是一个wordpress的主题。也没用太多的技术，主要是改了css，中间一些细节比较复杂，但是还是依附于wordpress。\r\n\r\n第四个项目是墨水项目，好像赚了4000，是一个wordpress主题，改了改样式。\r\n\r\n第五个项目是大师姐官网，主要也是静态页，7、8个。\r\n\r\n第六个项目是文学地图项目。从模板开始定制，到后台小伙伴自主书写。慢慢变得强大。\r\n\r\n到头来对自己的要求总是进展缓慢，而项目也没有太多高难度的需求。\r\n\r\n以后争取一年做一个项目，才能变得更厉害。",
      "data": {
        "title": "独立开发者",
        "date": "2019-11-29 19:27:22",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "独立开发者，就是一个人做项目。想想从学校到现在，我做过哪些项目。一些启发和思考，记录在此。\r",
      "fileName": "du-li-kai-fa-zhe"
    },
    {
      "content": "大学老师要做一个国家社科基金的重大项目。之前让别的学生来做。但是做了2个月，并没有达到老师的效果。于是让我和小伙伴赶忙上阵，要10天时间完成一个大项目，任务艰巨。\r\n\r\n<!-- more -->\r\n\r\n## 网站介绍\r\n本项目收集了唐长安至汴州道馆驿地的诗词，通过地图索引、诗人、时间等多个维度，展现这些诗词。为师生的学习和检索，提供了一个平台。\r\n\r\n## 技术概览\r\n前端：HTML、CSS、JavaScript\r\n后台：PHP\r\n数据库：MySql\r\n服务器：Nginx\r\n\r\n## 前端语言\r\n前端方面使用了HTML、CSS和JavaScript。HTML注重语义化和结构化，进行了SEO搜索引擎优化。CSS注重样式的重用性，实现多类的样式复用。JavaScript实现了一些动态交互，进行了全面的交互设计。\r\n响应式设计\r\n\r\n随着移动设备的流行，一套网站多处适配已经变得非常重要。本站采用了响应式设计，能够智能的对多宽度、多终端设备进行适配。能够在手机、平板、PC电脑方便浏览、检索。免去了专门制作手机端，专门维护手机端的精力。在手机端的顶部菜单，进行了特殊设计，方便展开收起。\r\n\r\n## 交互设计\r\n全站全面的考虑到了交互设计和动态效果，实现了一些渐变和动画，避免了网页的生硬。如首次加载的时候，“两京大道多游客，每遇词人战一场”等标题文字渐渐上浮出现。而“精确查找”“智能匹配”的搜索框，下浮出现。网站首页的底部，有统计状态栏，在首次加载的时候，实现了数字递增动画。在搜索结果为地理位置时，由于地理介绍过长，设置了展开收起的按钮。\r\n\r\n## 地图API\r\n为了更好的展示唐长安至汴州道馆驿地的各个位置，我们实现了利用百度地图API的地理接口进行了古代地理驿站的地名和位置标注。实现了“古今统一”。能够方便直观的从另一个维度检索这些诗词和地名。点击相关词条，能够进入相关页面进行搜索。\r\n\r\n## 后端技术\r\n后端使用PHP进行开发。为了更好的展示诗词，我们进行了深入的思考和需求分析。在首页放置了精确查找和智能匹配两个检索框。如果检索的内容是诗句、标题，则结果相对唯一。能够进入单条的诗词界面进行阅读观看。如果搜索的是年代、作者、地点，则结果是一组结果，则进入搜索信息的聚合页面，进行智能展示。搜索的是作者，则会在检索页面中首先展示这个作者的相关信息，再显示这个作者的词作。如果搜索的是地名，则首先展示地理地图和该位置的相关介绍，再展示这个位置的词作。通过这种方式，能够迅速让师生找到想要的结果，节约了检索时间。 此外，对于大量的诗作，师生如果想看全部的内容。我们制作了索引页面，展示了数据库内的存储的全部诗作。可以从诗人、题目、地理位置三个方面进行索引。方便逐篇观看。\r\n\r\n## 后台管理\r\n由于诗歌的内容不是一成不变的，我们开发了后台管理系统。能够对每一篇诗歌进行内容的修改。能够增加新的诗歌篇目。对已有的数据进行增删改查。从而在后期运营的过程中，能够不断对内容进行扩充和完善。\r\n\r\n## 心得体会\r\n在这次项目制作中，我担任了产品经理、前端开发的角色。小伙伴担任了后台和服务器的部署维护。\r\n首先老师对这个产品只有大致的规划，要具体实现这个产品。需要一个懂得产品设计的产品经理进行细致的规划。什么地方放置按钮，点了哪个链接进入什么样的页面。很多地方我都和小伙伴一起讨论，力争把这个产品的细节做到最好。\r\n第二个方面是前端开发，要把这个产品的5个静态页面做出来。用了一个html5up的响应式模板，对其中的内容进行了一些替换。最关键的是老师要求把诗歌的地点通过地图标注出来，我又研究了一下百度地图的API借口，把点怎么标注出来，下面写上地名。总算是实现了老师的需求。在大学觉得遥不可及的技术，现在我和小伙伴两下就搞定了。\r\n在这次开发中，有一个可靠的小伙伴，完成项目事半功倍。我专心研究前台这些东西，他把后台、数据库和服务器搞定。\r\n后期上线之后，老师对产品进行了测试。对于一些内容提出了修改意见，大部分是涉及样式和结构的，加上github上的项目协作，我会直接在小伙伴的php代码上修改，并且知道了部署上线的方法。产品更迭很快。\r\n在这次开发中，还是有一些缺点和不足。前期准备工作做的不充分，后台语言我还是不太精通。为了以后能够更好的适应这个社会，我要继续加油努力。学习更多的技术知识，用自己的双手改变是世界。",
      "data": {
        "title": "文学地图项目思考",
        "date": "2019-11-28 19:23:36",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": "/post-images/wen-xue-di-tu-xiang-mu-si-kao.jpg",
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "大学老师要做一个国家社科基金的重大项目。之前让别的学生来做。但是做了2个月，并没有达到老师的效果。于是让我和小伙伴赶忙上阵，要10天时间完成一个大项目，任务艰巨。\r",
      "fileName": "wen-xue-di-tu-xiang-mu-si-kao"
    },
    {
      "content": "博客的本质是记录，能满足记录、传播的系统，就是博客。 从新浪博客、到点点网、到印象笔记、再到自建wordpress，尘归尘土归土，博客，主题、功能太多，折腾时间久了，竟然也疲倦了。\r\n\r\n<!-- more -->\r\n\r\n最简单的github里用markdown，插图不方便。而wordpress有略显笨重，总要折腾。看来看去，能够数据独自托管，还能方便插图的小而美的博客。就是这里了。\r\n今天是2019年11月28日，2019年即将结束了，2020又马上开启。希望2020年有新收获，在此细细记录，不虚此博。\r\n\r\n",
      "data": {
        "title": "jnblog 又一个前端博客",
        "date": "2017-11-01 08:46:09",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "博客的本质是记录，能满足记录、传播的系统，就是博客。 从新浪博客、到点点网、到印象笔记、再到自建wordpress，尘归尘土归土，博客，主题、功能太多，折腾时间久了，竟然也疲倦了。\r",
      "fileName": "jnblog-you-yi-ge-qian-duan-bo-ke"
    },
    {
      "content": "今天是毕业典礼，早晨先是荣誉免费早餐。我们学院就两个人收到表彰，一个是Eliana. Eliana保加利亚出生，平均GPA达到惊人的3.7. 德国人，犹太民族，让我一次又一次佩服这个小姑娘。还有一个是我。算下来21门课我18门A，GPA3.6，成绩也不差。全校还有一个人获得了超级优秀毕业生，她从麻省理工大学转学过来，GPA是4.0，也就是说，在本校的40门课，所有课程都是A，满分的成绩，让我有一种大神降临的感觉。\r\n之后大家一同去体育场参加毕业典礼，我们首先在外场等候。毕业生都已经穿好学士服，整齐划一，让我不禁想到了去年的在西工院人文学院的毕业典礼。然后大家依次入场，当我看到体育场满满的观众和同学们的亲朋好友的时候，一下就感动了，甚至家长都从国外赶来，一起来目睹这个伟大的时刻。我们坐在体育场正中央，今天是我们的主角。电视台对今天的毕业典礼面向全新墨西哥洲进行现场直播，瞬间高大尚了。先是由音乐学院的毕业生合唱国歌，大家纷纷起立脱帽表示庄重。然后校长讲话，各个院长讲话，最让我惊讶的事情是，四个角还有手语同步现场翻译，想的十分周到。这一届是本校历史上最多的毕业生，在学校第一次见这么多的人。接着大家上台接受毕业证书，并合影留念，掌声不断，秩序井然。和我一起的同学，我们一同奋斗了2年，今天也是说再见的时候，虽然不忍，但没有不散的宴席。和每个老师都合影留念，感谢教育和关怀，给我们说了祝福的话。最后，乐队演奏校歌，全场鼓掌打着节奏，气氛达到了最高，我一下又被感动了，无数次的旋律啊，跟着使命的鼓掌。之后是免费的午餐，我特意找kala合影，kala在让我绝望的COMM414课程上对我帮助极大，要不是最后和她一个小组，我们终极作业拿了100分，这课我就挂了。还有Eliana，每次我都抄她COMM414的笔记(不是抄作业，作业不能抄)。其他课一天学1、2个小时，拿个A还是有可能的。这门地狱一般的课，让我动用了我高考最后冲刺的精神去学，发动了全部的力量，终于过了。然后我大吃了一顿饭，反正免费供应，以后也吃不上学校免费的饭了，又突然间沮丧起来。\r\n\r\n金色年华的美国生活，曾无数次翘首期盼，却浑然不知的走完两年时光。璀璨琉璃的留学岁月，曾无数次渴求仰望，却悄无声息的走向终点。毕业典礼，曾天真的以为还十分遥远，却已经置身其中，穿上了学士服，带上了学士帽。周围的掌声，校长的讲话，同学的合影，这一切一切，仿佛是已经写好的剧本，进行人生的彩排。又仿佛是一场梦境，虚虚实实。回首两年的岁月，悲欢离合。然而最重要的不是英语不是文凭。对我而言就两样东西：一是一种把我放到任何国家任何我谁都不认识的地方我都能生存下去的能力；和一种名车豪宅已动摇不了我愿意每天坐公车去追求简单梦想的平淡心态。而我认为，这两样足以让我受益终身。\r\n\r\n两年前的今天，东新墨西哥对我来说就是简单的五个汉字，我在图书馆让协会会员英语专业的黄烨琦帮我翻译美国的学位计划，后来我去成都签证，拿着地图游成都。一年前的今天，我坐上了回国的飞机，一年的学习生活结束，心情错综复杂，质疑是否继续坚持这条路的决心，后来回到协会进行了协会成立四周年的演讲。现在，用两年的经历，深深体会到了东新墨西哥是什么，美国是什么，所有的一切，终于画上了一个句号，然而，我最珍藏的记忆，还是大三那年每天在F楼背新概念的那段时光，从冬天一直到夏天，无论风吹日晒，或者寂静夜晚，那时的楼道里只有我的读书声。也许从那时候开始，我就有一个梦想，游历美国，报效祖国的梦想！\r\n<!-- more -->\r\n\r\n<!-- more -->\r\n",
      "data": {
        "title": "毕业典礼",
        "date": "2014-05-10 15:38:57",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": null,
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "今天是毕业典礼，早晨先是荣誉免费早餐。我们学院就两个人收到表彰，一个是Eliana. Eliana保加利亚出生，平均GPA达到惊人的3.7. 德国人，犹太民族，让我一次又一次佩服这个小姑娘。还有一个是我。算下来21门课我18门A，GPA3.6，成绩也不差。全校还有一个人获得了超级优秀毕业生，她从麻省理工大学转学过来，GPA是4.0，也就是说，在本校的40门课，所有课程都是A，满分的成绩，让我有一种大神降临的感觉。\r\n之后大家一同去体育场参加毕业典礼，我们首先在外场等候。毕业生都已经穿好学士服，整齐划一，让我不禁想到了去年的在西工院人文学院的毕业典礼。然后大家依次入场，当我看到体育场满满的观众和同学们的亲朋好友的时候，一下就感动了，甚至家长都从国外赶来，一起来目睹这个伟大的时刻。我们坐在体育场正中央，今天是我们的主角。电视台对今天的毕业典礼面向全新墨西哥洲进行现场直播，瞬间高大尚了。先是由音乐学院的毕业生合唱国歌，大家纷纷起立脱帽表示庄重。然后校长讲话，各个院长讲话，最让我惊讶的事情是，四个角还有手语同步现场翻译，想的十分周到。这一届是本校历史上最多的毕业生，在学校第一次见这么多的人。接着大家上台接受毕业证书，并合影留念，掌声不断，秩序井然。和我一起的同学，我们一同奋斗了2年，今天也是说再见的时候，虽然不忍，但没有不散的宴席。和每个老师都合影留念，感谢教育和关怀，给我们说了祝福的话。最后，乐队演奏校歌，全场鼓掌打着节奏，气氛达到了最高，我一下又被感动了，无数次的旋律啊，跟着使命的鼓掌。之后是免费的午餐，我特意找kala合影，kala在让我绝望的COMM414课程上对我帮助极大，要不是最后和她一个小组，我们终极作业拿了100分，这课我就挂了。还有Eliana，每次我都抄她COMM414的笔记(不是抄作业，作业不能抄)。其他课一天学1、2个小时，拿个A还是有可能的。这门地狱一般的课，让我动用了我高考最后冲刺的精神去学，发动了全部的力量，终于过了。然后我大吃了一顿饭，反正免费供应，以后也吃不上学校免费的饭了，又突然间沮丧起来。\r\n\r\n金色年华的美国生活，曾无数次翘首期盼，却浑然不知的走完两年时光。璀璨琉璃的留学岁月，曾无数次渴求仰望，却悄无声息的走向终点。毕业典礼，曾天真的以为还十分遥远，却已经置身其中，穿上了学士服，带上了学士帽。周围的掌声，校长的讲话，同学的合影，这一切一切，仿佛是已经写好的剧本，进行人生的彩排。又仿佛是一场梦境，虚虚实实。回首两年的岁月，悲欢离合。然而最重要的不是英语不是文凭。对我而言就两样东西：一是一种把我放到任何国家任何我谁都不认识的地方我都能生存下去的能力；和一种名车豪宅已动摇不了我愿意每天坐公车去追求简单梦想的平淡心态。而我认为，这两样足以让我受益终身。\r\n\r\n两年前的今天，东新墨西哥对我来说就是简单的五个汉字，我在图书馆让协会会员英语专业的黄烨琦帮我翻译美国的学位计划，后来我去成都签证，拿着地图游成都。一年前的今天，我坐上了回国的飞机，一年的学习生活结束，心情错综复杂，质疑是否继续坚持这条路的决心，后来回到协会进行了协会成立四周年的演讲。现在，用两年的经历，深深体会到了东新墨西哥是什么，美国是什么，所有的一切，终于画上了一个句号，然而，我最珍藏的记忆，还是大三那年每天在F楼背新概念的那段时光，从冬天一直到夏天，无论风吹日晒，或者寂静夜晚，那时的楼道里只有我的读书声。也许从那时候开始，我就有一个梦想，游历美国，报效祖国的梦想！\r",
      "fileName": "graduate"
    },
    {
      "content": "以大多数人的努力之低，根本轮不到拼天赋。——题记 2年，4学期，720天。转眼间日夜期盼的日子，还是那么不友好的到来。曾经觉得那么遥不可及，曾经认为是不可逾越，曾经以为在天涯海角。现在，就在眼前。 \r\n\r\n<!-- more -->\r\n\r\n以前，我只是知道，在这个文明古国的平行世界，还有着令外一个别样天地，那里的人们说着与我们不一样的语言，那块宝地令人神往。然而通向这个世界的路异常崎岖，我都不曾想我会走完。 人生的轨迹总是那么不可思议，回到大一不会想到大三那时的收获，放眼大三更不会想到今天的成就。未来又是那么的变幻莫测，也许让今天想都不敢想像。 初来美国时的我，是那么的幼稚天真。以为这个世界上没有过不去的坎，然而这个坎还是挡住了很多人的路。是头破血流的认载，还是头破血流的上路。命运不会捉弄人，只会捉弄认命的人。\r\n\r\n# 第一章 坎坎坷坷 一路高歌\r\n\r\n来美国的签证手续，难倒了一批人。初来时的环境适应，难倒了一批人。上课能不能听懂，难倒一批人。如何在这个陌生的世界活下去，又难倒了一批人。每次都是一个坎，拍拍身上的土，继续上路。第一学期最大的困难，是在完全改变的环境中快速适应并生存下来。从语言，到文化，从课堂，到生火做饭自立更生。当时的我一个月写一篇长篇文章，记录我的生活，现在看来，是多么的幼稚，但是，也是深深的回忆。所有一切，有新奇，也有无耐。大二开始的泡馆计划，不得不说不仅是一个明智的决定，而且是一生的财富。这个学期我大部分时间是在消化课堂的东西和新概念英语的背诵，我是图书馆的常客。18学分6门课，COMM101和COMM204这两门专业课的难度并不大，然而听起来还是十分吃力。我并没有交多少朋友，只是在自己的世界里生活，囚禁自己的，是思想的牢笼。做着难吃的饭，背着无聊的单词。对我来说任务只有一个——活下来！\r\n\r\n# 第二章 心若向阳 无畏伤悲\r\n\r\n寒假我并没有回家，早晨早早起来听英语听力。每天重复着学习学习还是学习的简单生活。12月的寒冬，呼啸的风，白茫茫的天地。然而负面情绪还是笼罩着我，那就是对家乡的思念。我写了长篇文章，表达了对朋友和过去的种种的思念。一次次比赛，一次次相逢和离别，仿佛在昨天，实际已经过去很多年。这学期17分5门课1门实习。相别就在昨天，转眼已天涯海角。从ENG102的美国文化，到COMM102的大众演讲。从COMM210的音频制作，到COMM103大众传播学，再到新闻写作。还有每周二周四去KENW-TV的6小时实习。排的满满当当，还要去图书馆，呼吸都困难。我甚至想，如果不选这条路，现在的我，是不是已经写好论文，在家或睡着大觉，或写着日记抒发对不忍毕业的感概，也在质疑，为什么选这条路。我也坚信，心若向阳，无畏伤悲。后来，寒假回国，吃了很多散伙饭，发了很多说说，舍不得09级的离别。因为，不知过了今日，今后何时相见。\r\n\r\n# 第三章 金戈铁马 所向披靡\r\n\r\n第三学期，我还是来了。我真正想放弃的时刻，不是第一学期，而是此时。面对不能2年毕业的情况，你是否能坚持。这学期是最艰难的一个学期，比第一学期更难！COMM331跨文化交际，考试考的人死去活来。BUS310的全球经济，每次长篇论文都绞尽脑汁。COMM220和COMM311的视频制作，还好有很大的基础。这学期的实习是在KENW-TV作图片处理。困难的用英语讨论专业问题。让人绝望的课只有一个，COMM414媒体法。每次考试都是选择题，要背诵大量的人名，地名，案例名，年代。最后项目提案获得100分，此外化学的挑战也通过，完成本学期大收关。寒假回国，做演讲，见朋友，说说一年心事，勇往直前。\r\n\r\n# 第四章 不是结束 是新开始\r\n\r\n这学期在开始之前，我已经知道了结局。我只不过是按照剧本的规划来写而已。我在日记是每次写“不是结束 是新开始”的时候。后面的故事都应验了这句话。每次在人生的十字路口，我都会打这句话写到纸上。从高三，到补习班，到大三，到现在。未来是什么。我也不知道，但是我知道，肯定会更好。这学期我去了纽约旅游，见识了真正的美国大城市。我开始在workshop实习中大胆说话，和朋友谈天说地，好不热闹。毕业前最后三门课，虽然作业是有不少，但是还是十分轻松。我在图书馆找了一个小工作，体验工作的乐趣，我开始做更多种类的饭。开始更珍惜每一天的时间。临走前和每一个朋友都合影，因为再一次见面实在太难，说了道别和珍重的话。在最后的总结大学的终级演讲上，我回顾了我的大学生活。我说道：it is hard to make a conclusion for my five years college life only in five minutes. But thank all the teachters and friends give me help. Thank Americna open a new window for me. In the future, when I recall one of the best memory in my life, I think the answer is - you!\r\n\r\n# 写在最后\r\n\r\n是的，日夜期盼的毕业，终是来临。却是难过大于喜悦。如果重新站在大三的路口，我一定还会选择这条美国之路，并勇往直前的走下去的。虽也有很多遗憾，也有很多坎坷，但毕竟终是到了车站。向着一路陪伴的人说再见，寻找下一个人生起点。每个人都有自己故事，只是演绎的方式不同。不要去羡慕别人所拥有的幸福。我们以为自己没有的，可能在别人的眼里，我们也演绎的很精彩。我们以为别人演绎精彩的部分，可能在在另一些人看来，不以为然。也许平行世界的另一个我，没有选择这条艰苦的路。此刻的他刚刚起床，准备去上班。他的大四过的波澜不惊，现在在一个不好不差的单位。过着日复一日的枯燥的生活。他在这条路上，也有着很多收获，很多朋友，也有很多遗憾。不过，有句话说的好：无论选择哪条路，肯定都会对没走的那条路念念不忘吧，所以这世上没有毫不后悔的选择，而且生活也是没有正确答案的，只要坚信选择的道路就是正确答案，并把它变成正确答案就可以了。二年的美国之行结束了，下一个人生起点，我来了！\r\n",
      "data": {
        "title": "写在美国之行最后",
        "date": "2014-05-03 19:17:13",
        "tags": [],
        "published": true,
        "hideInList": true,
        "feature": "/post-images/xie-zai-mei-guo-zhi-xing-zui-hou.jpg",
        "isTop": false
      },
      "isEmpty": false,
      "excerpt": "",
      "abstract": "以大多数人的努力之低，根本轮不到拼天赋。——题记 2年，4学期，720天。转眼间日夜期盼的日子，还是那么不友好的到来。曾经觉得那么遥不可及，曾经认为是不可逾越，曾经以为在天涯海角。现在，就在眼前。 \r",
      "fileName": "xie-zai-mei-guo-zhi-xing-zui-hou"
    }
  ],
  "tags": [
    {
      "name": "Gridea",
      "slug": "Ab13r1dZA",
      "used": false
    }
  ],
  "menus": [
    {
      "link": "/",
      "name": "首页",
      "openType": "Internal"
    },
    {
      "link": "/tags",
      "name": "标签",
      "openType": "Internal"
    }
  ]
}